[
  {
    "id": "kb-001",
    "category": "heating",
    "keywords": ["boiler", "pressure", "low pressure", "gauge", "bar"],
    "issueDescription": "Low boiler pressure",
    "approvedResponse": "Thank you for reporting this issue. Low boiler pressure is often easy to fix yourself. Here's what to do:\n\n1. Locate the filling loop (usually a braided silver hose under the boiler)\n2. Slowly open the valves on both ends of the filling loop\n3. Watch the pressure gauge - fill until it reads between 1.0 and 1.5 bar\n4. Close both valves securely\n5. If the pressure keeps dropping, there may be a leak - please let us know and we'll send a technician.\n\nIf you're not comfortable doing this, reply to this email and we'll arrange a visit.",
    "safetyLevel": "safe",
    "minimumConfidence": 0.7
  },
  {
    "id": "kb-002",
    "category": "electrical",
    "keywords": ["fuse", "fuse box", "tripped", "breaker", "circuit", "power out"],
    "issueDescription": "Tripped circuit breaker or blown fuse",
    "approvedResponse": "It sounds like you may have a tripped circuit breaker. Here's how to safely reset it:\n\n1. Go to your fuse box/consumer unit (usually in the hallway or utility area)\n2. Look for any switches that are in the 'off' position or halfway\n3. Switch them fully off, then back on\n4. If the breaker trips again immediately, please do NOT keep resetting it - contact us for an electrician.\n\nNote: If you notice any burning smells, scorch marks, or if the issue keeps recurring, please reply immediately and we will escalate to an emergency electrician.",
    "safetyLevel": "caution",
    "minimumConfidence": 0.75
  },
  {
    "id": "kb-003",
    "category": "safety",
    "keywords": ["smoke alarm", "smoke detector", "battery", "beeping", "chirping"],
    "issueDescription": "Smoke alarm beeping - battery replacement",
    "approvedResponse": "The chirping sound usually indicates a low battery. Here's how to replace it:\n\n1. Use a stable step ladder to reach the alarm safely\n2. Twist the alarm counter-clockwise to remove it from the base\n3. Replace the battery with a new 9V battery (or AA batteries depending on model)\n4. Twist the alarm back onto the base until it clicks\n5. Press the test button to confirm it's working\n\nImportant: If the alarm continues to chirp after battery replacement, or if it's over 10 years old, please let us know so we can replace the unit.",
    "safetyLevel": "safe",
    "minimumConfidence": 0.8
  },
  {
    "id": "kb-004",
    "category": "plumbing",
    "keywords": ["toilet", "running", "flush", "cistern", "water running"],
    "issueDescription": "Toilet continuously running",
    "approvedResponse": "A continuously running toilet is usually caused by the fill valve or flapper. You can try this quick fix:\n\n1. Remove the cistern lid carefully\n2. Check if the float arm/ball is stuck - gently move it up and down\n3. Check if the flapper (rubber seal at the bottom) is seated properly\n4. If the flapper looks worn or warped, it may need replacing\n\nIf these steps don't resolve the issue, we'll arrange for a plumber to visit. This is not urgent but should be fixed soon to avoid water waste.",
    "safetyLevel": "safe",
    "minimumConfidence": 0.7
  },
  {
    "id": "kb-005",
    "category": "safety",
    "keywords": ["gas", "smell", "leak", "gas leak", "rotten eggs"],
    "issueDescription": "Suspected gas leak",
    "approvedResponse": "URGENT SAFETY NOTICE: If you smell gas, please take the following steps immediately:\n\n1. Do NOT operate any electrical switches or appliances\n2. Open windows and doors to ventilate\n3. Turn off the gas at the meter if safe to do so\n4. Leave the property\n5. Call the National Gas Emergency Service: 0800 111 999\n\nDo not return until the gas service has confirmed it's safe. We have also alerted our emergency contractor.",
    "safetyLevel": "unsafe",
    "minimumConfidence": 0.5
  },
  {
    "id": "kb-006",
    "category": "appliance",
    "keywords": ["washing machine", "won't drain", "not draining", "water stuck"],
    "issueDescription": "Washing machine not draining",
    "approvedResponse": "If your washing machine isn't draining, try these steps:\n\n1. Check the filter (usually at the front bottom) - place a towel and bowl underneath, as water will come out\n2. Clean out any debris, coins, or lint from the filter\n3. Check the drain hose isn't kinked or blocked\n4. Run a spin cycle to test\n\nIf the problem persists after cleaning the filter, please let us know and we'll arrange for an engineer visit.",
    "safetyLevel": "safe",
    "minimumConfidence": 0.7
  },
  {
    "id": "kb-007",
    "category": "electrical",
    "keywords": ["no power", "power cut", "electricity out", "lights out", "blackout"],
    "issueDescription": "Complete power outage",
    "approvedResponse": "First, let's determine if this is a local or building-wide issue:\n\n1. Check if your neighbours also have no power\n2. Check your fuse box for any tripped switches\n3. If it's just your flat and the fuse box looks normal, there may be a supply issue\n\nIf your neighbours are also affected, this is likely a network power cut. You can check the status at your local Distribution Network Operator's website or call 105 (the national power cut number).\n\nIf it's only affecting your property and the fuse box seems fine, please reply and we'll send an electrician.",
    "safetyLevel": "caution",
    "minimumConfidence": 0.7
  }
]
