[
  {
    "id": "msg-001",
    "subject": "Boiler pressure keeps dropping",
    "body": "Hi, I've noticed that my boiler pressure gauge is showing really low pressure - it's down to about 0.5 bar. The heating still works but I'm worried it might stop completely. Is this something I can fix myself or do I need an engineer? Thanks, John"
  },
  {
    "id": "msg-002",
    "subject": "URGENT - I can smell gas!!",
    "body": "There's a strong smell of gas in my kitchen, it started about 10 minutes ago. I don't know what to do, please help!!"
  },
  {
    "id": "msg-003",
    "subject": "Smoke alarm won't stop beeping",
    "body": "My smoke alarm has been making a chirping sound every 30 seconds or so. It's been doing this for the last few days and it's driving me crazy, especially at night. How do I make it stop?"
  },
  {
    "id": "msg-004",
    "subject": "Half the lights in my flat don't work",
    "body": "I came home today and the lights in my bedroom, bathroom and hallway don't work. The living room and kitchen are fine. I checked and the bulbs seem ok. Not sure what's happening."
  },
  {
    "id": "msg-005",
    "subject": "Locked out of building",
    "body": "Hi, my fob isn't working and I can't get into the building. I've tried it multiple times but the door just won't open. I'm standing outside in the rain! Can someone help please?"
  },
  {
    "id": "msg-006",
    "subject": "Toilet keeps running",
    "body": "The toilet in our bathroom won't stop running. After you flush it just keeps going. It's been like this for about a week now and I imagine it's wasting a lot of water."
  },
  {
    "id": "msg-007",
    "subject": "Question about my service charge",
    "body": "I received my service charge statement and I don't understand some of the items. There's a charge for 'reserve fund contribution' that seems higher than last year. Can someone explain what this is for?"
  },
  {
    "id": "msg-008",
    "subject": "Washing machine problem",
    "body": "Hi there, my washing machine finished its cycle but there's still water at the bottom and my clothes are soaking wet. The door is locked and I can't get them out. Any advice?"
  },
  {
    "id": "msg-009",
    "subject": "Something wrong with heating maybe?",
    "body": "It's been a bit cold in my flat lately. Not sure if it's just the weather or if something is wrong. The radiators seem warmish but maybe not as hot as they should be? I dunno, might be nothing."
  },
  {
    "id": "msg-010",
    "subject": "Crack in wall",
    "body": "I've noticed a crack appearing in the wall of my living room. It's about 30cm long and seems to be getting bigger. The building is quite old so I don't know if this is normal or something to worry about?"
  }
]
